#!/usr/bin/env python

# -*- *************** -*-
# @File  : append_test.py
# @Description : 
# @Author: mql
# @Time  : 2020-06-29 17:56
# -*- *************** -*-


# 当使用 w＋ 、 wb＋模式打开文件时， 会导致文件内容被清空 。 因此，
# 无论程序运行多少次，其输出的文件内容都只保留最近一次的输出数据。 如果程序希望在文件后面
# 追加内容，则应该使用 a＋或 ab＋模式。例如如下程序。
import os
f = open('z.txt', 'a+')
f.write('我爱Python' + os.linesep)
f.writelines(('土门壁甚坚，' + os.linesep,
              '杏园度亦难。' + os.linesep,
              '势异邺城下，' + os.linesep,
              '纵死时犹宽。' + os.linesep))

# 上面程序 以 a＋模式打开指定文件，这意味着 以追加模式来打开文件，因此，使用 open（）函数
# 打开文件后， 不会立即清空文件内容，并且会将文件指针移动到文件结尾处，程序会在文件结尾处
# 追加内容 。
# 每次运行上面程序，都会向 z.txt 文件中追加一段内容；程序运行的次数越多， z.txt 文件的内
# 容就会越多。